Tekla.Structures.ModelInternal.DelegateFake.ExportCreatePart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.DelegateFake.ExportCreateLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32)


Tekla.Structures.ModelInternal.DelegateFake.ExportValidateLoftedPlate(System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@)


Tekla.Structures.ModelInternal.DelegateFake.ExportCreateBentPlateByParts(System.Int32,System.Int32,System.Int32)


Tekla.Structures.ModelInternal.DelegateFake.ExportCreateBentPlateByPartsAndRadius(System.Int32,System.Int32,System.Double)


Tekla.Structures.ModelInternal.DelegateFake.ExportCreateConicalBentPlateByPartsAndRadiusAperture(System.Int32,System.Int32,System.Double,System.Double)


Tekla.Structures.ModelInternal.DelegateFake.ExportCreateConicalBentPlateByPartsAndTwoRadiuses(System.Int32,System.Int32,System.Double,System.Double)


Tekla.Structures.ModelInternal.DelegateFake.ExportCreateBentPlateByFaces(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Int32)


Tekla.Structures.ModelInternal.DelegateFake.ExportCreateBentPlateByFacesAndRadius(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Double)


Tekla.Structures.ModelInternal.DelegateFake.ExportCreateConicalBentPlateByFacesAndRadiusAperture(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Double,System.Double)


Tekla.Structures.ModelInternal.DelegateFake.ExportConnectGeometryTrees(Tekla.Structures.ModelInternal.dotClientId_t@,System.Int32)
DO NOT USE! For internal usage only!
clientId:
bendShape:
Returns:

Tekla.Structures.ModelInternal.DelegateFake.ExportConnectGeometryTreesWithRadius(System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
radius:
clientId:
Returns:

Tekla.Structures.ModelInternal.DelegateFake.ExportConnectGeometryTreesWithRadiusAperture(System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
largestRadius:
halfAperture:
clientId:
Returns:

Tekla.Structures.ModelInternal.DelegateFake.ExportConnectGeometryTreesByPoints(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@,System.Int32)
DO NOT USE! For internal usage only!
side1Start:
side1End:
side2Start:
side2End:
clientId:
bendShape:
Returns:

Tekla.Structures.ModelInternal.DelegateFake.ExportConnectGeometryTreesByPointsWithRadius(System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
radius:
side1Start:
side1End:
side2Start:
side2End:
clientId:
Returns:

Tekla.Structures.ModelInternal.DelegateFake.ExportConnectGeometryTreesByPointsWithRadiusAperture(System.Double,System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
largestRadius:
halfAperture:
side1Start:
side1End:
side2Start:
side2End:
clientId:
Returns:

Tekla.Structures.ModelInternal.DelegateFake.ExportModifyGeometryTreeCylindricalNodeRadius(System.Int32,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyConicalNodeRadiuses(System.Int32,System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyGeometryTreeConicalNodeByScale(System.Int32,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyGeometryTreeCylindricalNodeCurveType(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportSetNewBentPlateRoot(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyBendAngle(System.Double,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyGeometryTreePolygonNode(System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExplodeBentPlate(System.Int32)


Tekla.Structures.ModelInternal.DelegateFake.ExportExtractBentPlateFromComponent(System.Int32)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyBendSurfaceNode(System.Int32,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
firstBoundaryPoints:
secondBoundaryPoints:
surfacePoints:
clientId:
Returns:

Tekla.Structures.ModelInternal.DelegateFake.ExportGetBentPlateMinimumRadius(System.Int32)


Tekla.Structures.ModelInternal.DelegateFake.ExportGetBentPlateMaximumRadiuses(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportGetSpiralBeamEndPoint(System.Double,System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotVector_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportCalculateContourPolygon(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
DO NOT USE! For internal usage only.
contour: The contour.
polygon: The polygon.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportSelectPartWithGeometryTree(Tekla.Structures.ModelInternal.dotPart_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportSelectPart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.DelegateFake.ExportSelectLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32@)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyPart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyPartWithGeometryTree(Tekla.Structures.ModelInternal.dotPart_t@)


Tekla.Structures.ModelInternal.DelegateFake.ExportModifyLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32)


Tekla.Structures.ModelInternal.DelegateFake.EditMacro(System.String)
The EditMacro
FileName:  The macro filename
Returns:  Returns an integer

Tekla.Structures.ModelInternal.DelegateFake.StartMacroRecording(System.String)
The StartMacroRecording
FileName: The macro filename
Returns: Returns an integer

Tekla.Structures.ModelInternal.DelegateFake.StopMacroRecording
The StopMacroRecording
Returns:  Returns an integer

Tekla.Structures.ModelInternal.DelegateFake.RefreshMacroList
The RefreshMacroList
Returns:  Returns an integer

Tekla.Structures.ModelInternal.DelegateFake.IsMacroRecording
The IsMacroRecording
Returns:  Returns an integer

Tekla.Structures.ModelInternal.DelegateFake.ExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportCreateRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportModifyRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportSelectRebarEndDetailStrip(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportCreateRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportModifyRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportSelectRebarSplitter(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.DelegateFake.ExportSingleRebarGetRebarSet(System.Int32)
DO NOT USE! For internal usage only.
singleRebarId: The single rebar ID.
Returns: The rebar set ID if successful; otherwise 0.